Page({
  data: {
    showUploadTip: false,
    info: [
      { id: '1', title: '我与春风皆过客,你携秋水揽星河。' },
      { id: '2', title: '愿有岁月可回首,且以深情共白头。' },
      { id: '3', title: '三生有幸遇见你,纵使悲凉也是情。' },
      { id: '4', title: '即许一人以偏爱,愿尽余生之慷慨。' },
      { id: '5', title: '渐行渐远渐无书,水闊鱼沉何处问!' }
    ],
    option: {
      seed: {
        x: 1080 / 2 - 20,
        color: "rgb(190, 26, 37)",
        scale: 2
      },
      branch: [
        [535, 680, 570, 250, 500, 200, 30, 100, [
          [540, 500, 455, 417, 340, 400, 13, 100, [
            [450, 435, 434, 430, 394, 395, 2, 40]
          ]],
          [550, 445, 600, 356, 680, 345, 12, 100, [
            [578, 400, 648, 409, 661, 426, 3, 80]
          ]],
          [539, 281, 537, 248, 534, 217, 3, 40],
          [546, 397, 413, 247, 328, 244, 9, 80, [
            [427, 286, 383, 253, 371, 205, 2, 40],
            [498, 345, 435, 315, 395, 330, 4, 60]
          ]],
          [546, 357, 608, 252, 678, 221, 6, 100, [
            [590, 293, 646, 277, 648, 271, 2, 80]
          ]]
        ]]
      ],
      bloom: {
        num: 700,
        width: 1080,
        height: 650,
      },
      footer: {
        width: 1200,
        height: 5,
        speed: 10,
      }
    }
  },
  onShow() {
    this.backmusic()
  },
  backmusic() {
    let back = wx.getBackgroundAudioManager()
    player()
    function player() {
      back.title = "好有意思";   // 必须要有一个title
      back.src = "http://link.hhtjim.com/163/20953761.mp3";
      back.onEnded(() => {
        player()
      })
    }
  },
})
